## Terraform Checks (Prod)
#### Format Check 📏`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cloudflare-zerotrust.cloudflare_tunnel.clancy: Refreshing state... [id=e0bebaa4-5e51-4dfe-ba46-7537079b8c21]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.otp: Refreshing state... [id=50b72fee-0b55-4445-8a40-ab27d77e383b]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.github: Refreshing state... [id=f634c4de-f06b-4050-980b-39faa1115418]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_application.application: Refreshing state... [id=5d67eda7-bf1b-4814-a3f1-b30565fc3cb3]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_application.application: Refreshing state... [id=5e88ddf0-ec74-47ad-a75e-2fbc650d0fcc]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_application.application: Refreshing state... [id=326c177c-a5e4-4818-a86a-65f094eb21d0]
module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_application.application: Refreshing state... [id=6cee466e-9ab2-4d61-a760-9fdbef0682ee]
module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_application.application: Refreshing state... [id=2c358ab2-6213-46f0-b037-df26f5faaef3]
module.cloudflare-zerotrust.cloudflare_record.access_app_ha: Refreshing state... [id=6abae2688fa2d62906a9b8364db57b17]
module.cloudflare-zerotrust.cloudflare_record.access_app_homeradmin: Refreshing state... [id=00a8c40a0c1b6b79df6278d8e37e1fb2]
module.cloudflare-zerotrust.cloudflare_record.access_app_status: Refreshing state... [id=be8bce9852be8c55082b4b05020c74d5]
module.cloudflare-zerotrust.cloudflare_record.access_app_unifi: Refreshing state... [id=6a135c99bce63769fd700f3ba8c91848]
module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy: Refreshing state... [id=e0bebaa4-5e51-4dfe-ba46-7537079b8c21]
module.cloudflare-zerotrust.cloudflare_record.access_app_clancyadmin: Refreshing state... [id=5616ff453ebe738eafc85f53eebea1a1]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_policy.github_policy: Refreshing state... [id=cc0cd438-1603-475a-a476-c245157e26df]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_policy.github_policy: Refreshing state... [id=e991e3ba-ec04-4dad-8863-827363c56b5b]
module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_policy.github_policy: Refreshing state... [id=b6b249b1-968b-4088-85f3-0bc2127d19a9]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_policy.github_policy: Refreshing state... [id=8c269554-2014-48ed-8a10-24af3f920f8b]
module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_policy.github_policy: Refreshing state... [id=aa8bdcd6-2827-4e80-9c06-dfeaa41c4249]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloudflare-zerotrust.cloudflare_record.access_app_clancyadmin must be replaced
-/+ resource "cloudflare_record" "access_app_clancyadmin" {
      ~ created_on      = "2023-11-25T19:49:16.15117Z" -> (known after apply)
      ~ hostname        = "clancyadmin.morrislan.net" -> (known after apply)
      ~ id              = "5616ff453ebe738eafc85f53eebea1a1" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2023-11-25T19:49:16.15117Z" -> (known after apply)
      ~ name            = "clancyadmin.morrislan.net" -> "clancyadmin-prod.morrislan.net" # forces replacement
      ~ proxiable       = true -> (known after apply)
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "e0bebaa4-5e51-4dfe-ba46-7537079b8c21.cfargotunnel.com" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_ha must be replaced
-/+ resource "cloudflare_record" "access_app_ha" {
      ~ created_on      = "2023-11-25T19:49:15.387669Z" -> (known after apply)
      ~ hostname        = "ha.morrislan.net" -> (known after apply)
      ~ id              = "6abae2688fa2d62906a9b8364db57b17" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2023-11-25T19:49:15.387669Z" -> (known after apply)
      ~ name            = "ha.morrislan.net" -> "ha-prod.morrislan.net" # forces replacement
      ~ proxiable       = true -> (known after apply)
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "e0bebaa4-5e51-4dfe-ba46-7537079b8c21.cfargotunnel.com" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_homeradmin must be replaced
-/+ resource "cloudflare_record" "access_app_homeradmin" {
      ~ created_on      = "2023-11-25T19:49:15.660607Z" -> (known after apply)
      ~ hostname        = "homeradmin.morrislan.net" -> (known after apply)
      ~ id              = "00a8c40a0c1b6b79df6278d8e37e1fb2" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2023-11-25T19:49:15.660607Z" -> (known after apply)
      ~ name            = "homeradmin.morrislan.net" -> "homeradmin-prod.morrislan.net" # forces replacement
      ~ proxiable       = true -> (known after apply)
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "e0bebaa4-5e51-4dfe-ba46-7537079b8c21.cfargotunnel.com" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_status must be replaced
-/+ resource "cloudflare_record" "access_app_status" {
      ~ created_on      = "2023-11-25T19:49:19.155764Z" -> (known after apply)
      ~ hostname        = "status.morrislan.net" -> (known after apply)
      ~ id              = "be8bce9852be8c55082b4b05020c74d5" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2023-11-25T19:49:19.155764Z" -> (known after apply)
      ~ name            = "status.morrislan.net" -> "status-prod.morrislan.net" # forces replacement
      ~ proxiable       = true -> (known after apply)
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "e0bebaa4-5e51-4dfe-ba46-7537079b8c21.cfargotunnel.com" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_unifi must be replaced
-/+ resource "cloudflare_record" "access_app_unifi" {
      ~ created_on      = "2023-11-25T19:49:15.893295Z" -> (known after apply)
      ~ hostname        = "unifi.morrislan.net" -> (known after apply)
      ~ id              = "6a135c99bce63769fd700f3ba8c91848" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2023-11-25T19:49:15.893295Z" -> (known after apply)
      ~ name            = "unifi.morrislan.net" -> "unifi-prod.morrislan.net" # forces replacement
      ~ proxiable       = true -> (known after apply)
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "e0bebaa4-5e51-4dfe-ba46-7537079b8c21.cfargotunnel.com" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel.clancy must be replaced
-/+ resource "cloudflare_tunnel" "clancy" {
      ~ cname        = "e0bebaa4-5e51-4dfe-ba46-7537079b8c21.cfargotunnel.com" -> (known after apply)
      ~ id           = "e0bebaa4-5e51-4dfe-ba46-7537079b8c21" -> (known after apply)
      ~ name         = "clancy.morrislan.net" -> "clancy-prod.morrislan.net" # forces replacement
      ~ tunnel_token = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy will be updated in-place
  ~ resource "cloudflare_tunnel_config" "clancy" {
        id         = "e0bebaa4-5e51-4dfe-ba46-7537079b8c21"
      ~ tunnel_id  = "e0bebaa4-5e51-4dfe-ba46-7537079b8c21" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ config {
          ~ ingress_rule {
              ~ hostname = "status.morrislan.net" -> "status-prod.morrislan.net"
                # (1 unchanged attribute hidden)

                # (1 unchanged block hidden)
            }
          ~ ingress_rule {
              ~ hostname = "ha.morrislan.net" -> "ha-prod.morrislan.net"
                # (1 unchanged attribute hidden)

                # (1 unchanged block hidden)
            }
          ~ ingress_rule {
              ~ hostname = "unifi.morrislan.net" -> "unifi-prod.morrislan.net"
                # (1 unchanged attribute hidden)

                # (1 unchanged block hidden)
            }
          ~ ingress_rule {
              ~ hostname = "clancyadmin.morrislan.net" -> "clancyadmin-prod.morrislan.net"
                # (1 unchanged attribute hidden)

                # (1 unchanged block hidden)
            }
          ~ ingress_rule {
              ~ hostname = "homeradmin.morrislan.net" -> "homeradmin-prod.morrislan.net"
                # (1 unchanged attribute hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_application.application will be updated in-place
  ~ resource "cloudflare_access_application" "application" {
      ~ domain                     = "clancyadmin.morrislan.net" -> "clancyadmin-prod.morrislan.net"
        id                         = "6cee466e-9ab2-4d61-a760-9fdbef0682ee"
      ~ name                       = "Clancy Admin" -> "Clancy Admin (prod)"
        tags                       = []
        # (13 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_policy.github_policy will be updated in-place
  ~ resource "cloudflare_access_policy" "github_policy" {
        id                             = "b6b249b1-968b-4088-85f3-0bc2127d19a9"
      ~ name                           = "Clancy Admin GitHub Policy" -> "Clancy Admin (prod) GitHub Policy"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_application.application will be updated in-place
  ~ resource "cloudflare_access_application" "application" {
      ~ domain                     = "ha.morrislan.net" -> "ha-prod.morrislan.net"
        id                         = "5e88ddf0-ec74-47ad-a75e-2fbc650d0fcc"
      ~ name                       = "Home Assistant" -> "Home Assistant (prod)"
        tags                       = []
        # (13 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_policy.github_policy will be updated in-place
  ~ resource "cloudflare_access_policy" "github_policy" {
        id                             = "8c269554-2014-48ed-8a10-24af3f920f8b"
      ~ name                           = "Home Assistant GitHub Policy" -> "Home Assistant (prod) GitHub Policy"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_application.application will be updated in-place
  ~ resource "cloudflare_access_application" "application" {
      ~ domain                     = "homeradmin.morrislan.net" -> "homeradmin-prod.morrislan.net"
        id                         = "2c358ab2-6213-46f0-b037-df26f5faaef3"
      ~ name                       = "Homer Admin" -> "Homer Admin (prod)"
        tags                       = []
        # (13 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_policy.github_policy will be updated in-place
  ~ resource "cloudflare_access_policy" "github_policy" {
        id                             = "aa8bdcd6-2827-4e80-9c06-dfeaa41c4249"
      ~ name                           = "Homer Admin GitHub Policy" -> "Homer Admin (prod) GitHub Policy"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_application.application will be updated in-place
  ~ resource "cloudflare_access_application" "application" {
      ~ domain                     = "status.morrislan.net" -> "status-prod.morrislan.net"
        id                         = "5d67eda7-bf1b-4814-a3f1-b30565fc3cb3"
      ~ name                       = "Network Status" -> "Network Status (prod)"
        tags                       = []
        # (13 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_policy.github_policy will be updated in-place
  ~ resource "cloudflare_access_policy" "github_policy" {
        id                             = "e991e3ba-ec04-4dad-8863-827363c56b5b"
      ~ name                           = "Network Status GitHub Policy" -> "Network Status (prod) GitHub Policy"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_application.application will be updated in-place
  ~ resource "cloudflare_access_application" "application" {
      ~ domain                     = "unifi.morrislan.net" -> "unifi-prod.morrislan.net"
        id                         = "326c177c-a5e4-4818-a86a-65f094eb21d0"
      ~ name                       = "UniFi" -> "UniFi (prod)"
        tags                       = []
        # (13 unchanged attributes hidden)
    }

  # module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_policy.github_policy will be updated in-place
  ~ resource "cloudflare_access_policy" "github_policy" {
        id                             = "cc0cd438-1603-475a-a476-c245157e26df"
      ~ name                           = "UniFi GitHub Policy" -> "UniFi (prod) GitHub Policy"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 11 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
